Rails/1_Rails_Views/ninety-nine-cats-pt1/ninetynine_cats/app/views/cats/show.html.erb


<% if @cat.cat_rental_requests.exists? %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date DESC  [["cat_id", 1]]
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 LIMIT $2  [["cat_id", 3], ["LIMIT", 1]]


    <% rentals = @cat.cat_rental_requests.order('start_date DESC') %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date DESC  [["cat_id", 1]]