Rails/3_Rails_Testing/GoalSettingApp/app/controllers/cheers_controller.rb

    def create
        if current_user.exceed_cheer_limit?
            flash[:errors] << ['Exceeded Your Limit']
            redirect_back(fallback_location: root_url)
        end

        @cheer = Cheer.new(giver_id: current_user_id, goal_id: params[:goal_id])

        if @cheer.save
            current_user.decrement_cheer_count!
            goal_owner = Goal.find(params[:goal_id]).author.username
---
INSERT INTO "cheers" ("giver_id", "goal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["giver_id", 1], ["goal_id", 3], ["created_at", "2020-11-19 03:50:05.890274"], ["updated_at", "2020-11-19 03:50:05.890274"]]
UPDATE "users" SET "cheer_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cheer_count", 11], ["updated_at", "2020-11-19 03:54:25.044872"], ["id", 1]]
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]