Rails/3_Rails_Testing/GoalSettingApp/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_id", "body", "commentable_type", "commentable_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["body", "asdf"], ["commentable_type", "Goal"], ["commentable_id", 2]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user_id

        if @comment.save