Rails/3_Rails_Testing/GoalSettingApp/app/controllers/goals_controller.rb

    def create
        @goal = current_user.goals.new(goal_params)
        if @goal.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "goals" ("user_id", "title", "details", "private", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["title", "private goal"], ["details", "shhhhh"], ["private", true], ["created_at", "2020-11-16 15:24:53.209621"], ["updated_at", "2020-11-16 15:24:53.209621"]]

    def index
        @goals = current_user.goals.all
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 3]]

    def edit
        @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @goal = Goal.find(params[:id])

        if @goal.update_attributes(goal_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals" SET "title" = $1, "details" = $2, "updated_at" = $3 WHERE "goals"."id" = $4  [["title", "demo2"], ["details", "123"], ["updated_at", "2020-11-15 23:59:28.248006"], ["id", 1]]

    def destroy
        @goal = Goal.find(params[:id])
        @goal.destroy
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 137], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 137]]

    def complete
        @goal = Goal.find(params[:id])
        @goal.completed = !@goal.completed
        @goal.save!
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals" SET "completed" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["completed", true], ["updated_at", "2020-11-17 05:35:45.015439"], ["id", 1]]