Rails/3_Rails_Testing/GoalSettingApp/app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "YZUx8oNwSjvdCsGi4i8W_w"], ["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ccTU7L59-GkkM8_HkOLENw"], ["updated_at", "2020-11-19 03:39:30.844067"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token

    # Check if new token is unique
    while User.exists?(session_token: self.session_token)
      self.session_token = self.class.generate_session_token
    end

    self.save!

UPDATE "users" SET "cheer_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cheer_count", 11], ["updated_at", "2020-11-19 03:54:25.044872"], ["id", 1]]
---
  def decrement_cheer_count!
    self.cheer_count -= 1
    self.save!