Rails/5_Rails_Forms/RedditClone/app/controllers/application_controller.rb

    def vote(type, direction)
        @vote = current_user.votes.new(votable_type: type, votable_id: params[:id])
        @vote.value = direction
        if @vote.save
---
INSERT INTO "votes" ("user_id", "value", "votable_type", "votable_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["value", 1], ["votable_type", "Post"], ["votable_id", 1]]