Rails/5_Rails_Forms/RedditClone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_id", "post_id", "content", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 1], ["post_id", 2], ["content", "nah, bananas"], ["created_at", "2020-11-20 10:51:10.793954"], ["updated_at", "2020-11-20 10:51:10.793954"], ["parent_comment_id", 14]]
---
    def create
        @comment = current_user.comments.new(comment_params)
        if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."user_id" = $2 AND "votes"."votable_type" = $3 AND "votes"."votable_id" = $4 LIMIT $5  [["user_id", 3], ["user_id", 3], ["votable_type", "Comment"], ["votable_id", 4], ["LIMIT", 1]]
---
    def show
        # for showing comment
        @comment = Comment.find(params[:id])
        # for replying the comment, fills in the parent_comment_id, and on initialize, fills in the post_id too
        @new_comment = @comment.child_comments.new
        @vote = current_user.votes.find_or_initialize_by(user: current_user, votable_type: 'Comment', votable_id: params[:id])