Rails/5_Rails_Forms/RedditClone/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."user_id" = $2 AND "votes"."votable_type" = $3 AND "votes"."votable_id" = $4 LIMIT $5  [["user_id", 1], ["user_id", 1], ["votable_type", "Post"], ["votable_id", 1], ["LIMIT", 1]]
---
    def show
        @post = Post.find(params[:id])
        @vote = current_user.votes.find_or_initialize_by(user: current_user, votable_type: 'Post', votable_id: params[:id])

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @post = current_user.posts.new(post_params)

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "url" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["content", "what's a good course to learn js?"], ["url", "www.udemy.com"], ["updated_at", "2020-11-20 08:50:02.289833"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)