Rails/5_Rails_Forms/RedditClone/app/controllers/subs_controller.rb

    def show
        @sub = Sub.find(params[:id])
        @vote = current_user.votes.find_or_initialize_by(user: current_user, votable_type: 'Sub', votable_id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."user_id" = $2 AND "votes"."votable_type" = $3 AND "votes"."votable_id" = $4 LIMIT $5  [["user_id", 1], ["user_id", 1], ["votable_type", "Sub"], ["votable_id", 2], ["LIMIT", 1]]

    def create
        @sub = current_user.subs.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "brain foods"], ["description", "sushi and berries"], ["moderator_id", 2], ["created_at", "2020-11-19 15:00:25.753488"], ["updated_at", "2020-11-19 15:00:25.753488"]]

    def update
        @sub = Sub.find(params[:id])

        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "sushi and berries and milk"], ["updated_at", "2020-11-19 15:05:01.476010"], ["id", 1]]