SQL/03_Active_Record_II/polls_app/app/models/response.rb

SELECT "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def sibling_responses
        self.question
            .responses
            .where.not(responses: {id: self.id})

SELECT polls.author_id FROM "polls" INNER JOIN "questions" ON "questions"."poll_id" = "polls"."id" INNER JOIN "answer_choices" ON "answer_choices"."question_id" = "questions"."id" WHERE (answer_choices.id = 7)
---
    def respondent_is_not_poll_author
        # Question#answer_choices
        poll_author_id = Poll.joins(questions: :answer_choices)
                            .where('answer_choices.id = ?', self.answer_choice_id)
                            .pluck('polls.author_id')
                            .first