Rails/1_Rails_Views/ninety-nine-cats-pt1/ninetynine_cats/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-10-31 10:07:02.813016"], ["id", 2]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-11-05 14:18:40.858006"], ["id", 20]]
---
    def approve!
        raise 'not pending' unless self.status == 'PENDING'

        # transaction: protective block so that only permanent if all succeed
        transaction do
            self.status = 'APPROVED'
            self.save!

            # rejecting all overlapping pending requests
            overlapping_pending_requests.each do |req|
                req.update!(status: 'DENIED')

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-11-05 13:55:37.206432"], ["id", 16]]
---
    def deny!
        self.status = 'DENIED'
        self.save!