Rails/2_Rails_Auth/music_app/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def new
        @band = Band.find([params[:band_id]])

INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 6], ["title", "greatest hits"], ["year", 1980], ["created_at", "2020-11-14 07:05:04.779607"], ["updated_at", "2020-11-14 07:05:04.779607"]]
---
    def create
        @album = Album.new(album_params)

        if @album.save