Rails/2_Rails_Auth/music_app/app/controllers/application_controller.rb

    def current_user
        return nil if session[:session_token].nil?
        # Only query if we haven't set it
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "xG0CiAUO3gLJtaVwqk007w"], ["LIMIT", 1]]