Rails/2_Rails_Auth/music_app/app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["track_id", 1], ["note", "okay"], ["created_at", "2020-11-14 04:15:18.039607"], ["updated_at", "2020-11-14 04:15:18.039607"]]
---
    def create
        note = current_user.notes.new(note_params)
        note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 3]]
---
    def destroy
        # Only current_user can delete this note. If ID is not hers, can't delete
        if current_user_id != Note.find(params[:id]).user_id
            render json: "403: Forbidden: Not your note"
        else
            note = current_user.notes.find(params[:id])
            note.destroy