Rails/2_Rails_Auth/music_app/app/controllers/tracks_controller.rb

    def new
        @album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @track = Track.new(track_params)

        if @track.save
---
INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 5], ["title", "hey jude"], ["ord", 1], ["lyrics", "hey jude\r\nlalaa"], ["created_at", "2020-11-14 07:05:17.502657"], ["updated_at", "2020-11-14 07:05:17.502657"]]

    def update
        @track = Track.find(params[:id])

        if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "first 1111\r\nsecond 2222\r\nthird 3333\r\nlalala\r\nlalala"], ["updated_at", "2020-11-14 05:52:25.787998"], ["id", 1]]

    def destroy
        @track = Track.find(params[:id])
        @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]