Rails/2_Rails_Auth/music_app/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "activation_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def activate
        @user = User.find_by(activation_token: params[:activation_token])
---
SELECT  "users".* FROM "users" WHERE "users"."activation_token" = $1 LIMIT $2  [["activation_token", "7d6-T45Jm1LpIFDF9r3Y_Q"], ["LIMIT", 1]]