Rails/2_Rails_Auth/music_app/app/models/user.rb

    def activate!
        self.update_attribute(:activated, true)
---
UPDATE "users" SET "activated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["activated", true], ["updated_at", "2020-11-14 06:48:34.272175"], ["id", 9]]