Rails/1_Rails_Views/ninety-nine-cats-pt1/ninetynine_cats/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2020-11-03"], ["end_date", "2020-10-05"], ["created_at", "2020-10-31 09:12:44.748831"], ["updated_at", "2020-10-31 09:12:44.748831"]]
---
    def create
        @rental = CatRentalRequest.new(cat_rental_request_params)

        if @rental.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def approve
        # rental ID is in params!
        # approve_cat_rental_request_url(rental) => rental is CatRentalRequest obj
        @rental = CatRentalRequest.find_by(id: params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def deny
        @rental = CatRentalRequest.find_by(id: params[:id])