Rails/1_Rails_Views/ninety-nine-cats-pt1/ninetynine_cats/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (1) LIMIT $1  [["LIMIT", 1]]

    def show
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("name", "sex", "color", "birth_date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "birth_date" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "Garfield"], ["color", "orange"], ["birth_date", "1978-06-19"], ["description", "loves lasagna"], ["updated_at", "2020-10-31 07:38:03.081105"], ["id", 4]]