Rails/5_Rails_Forms/RedditClone/app/views/shared/_post_form.html.erb

SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]
---
        <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>%"
            <%= "checked" if @post.sub_ids.include?(sub.id) %>