Rails/2_Rails_Auth/music_app/app/views/tracks/_form.html.erb

SELECT  "bands".* FROM "bands" INNER JOIN "albums" ON "bands"."id" = "albums"."band_id" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 4]]
---
                <option disabled>--SELECT THE ALBUM--</option>
            <% @track.band.albums.each do |album| %>