Rails/2_Rails_Auth/music_app/app/views/tracks/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 5]]
---
<h3>Notes</h3>
<% @track.notes.each do |note| %>