Rails/2_Rails_Auth/music_app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
                <option disabled>--SELECT THE BAND --</option>
            <% Band.all.each do |band| %>