Rails/2_Rails_Auth/music_app/app/views/albums/show.html.erb

<ul>
    <% if @album.tracks.length > 0 %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]