Rails/0_Routes_and_Controllers/routes_and_controllers/routes_controllers/app/controllers/users_controller.rb

    def create
        # user = User.new(params.require(:user).permit(:name, :email))
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Terry"], ["email", "terry@example.com"], ["created_at", "2020-10-26 08:12:37.484212"], ["updated_at", "2020-10-26 08:12:37.484212"]]

    def update
        user = User.find(params[:id])
        # user.update or user.update_attributes
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "arryh@example.com"], ["updated_at", "2020-10-26 08:23:13.531391"], ["id", 1]]