Rails/2_Rails_Auth/music_app/app/views/bands/show.html.erb


<% if @band.albums.length > 0 %>
<ul>
    <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 3]]
SELECT  "albums".* FROM "albums" WHERE "albums"."band_id" = $1 LIMIT $2  [["band_id", 3], ["LIMIT", 1]]