Rails/3_Rails_Testing/GoalSettingApp/app/views/goals/show.html.erb

SELECT "cheers".* FROM "cheers" WHERE "cheers"."goal_id" = $1  [["goal_id", 6]]
---
        <th>Cheers</th>
        <td><%= @goal.cheers.length %></td>