Rails/3_Rails_Testing/GoalSettingApp/app/views/layouts/application.html.erb

      <p>Welcome <%= current_user_username %></p>
      <p>Cheers Received: <%= current_user.cheers_received.length %></p>
---
SELECT "cheers".* FROM "cheers" INNER JOIN "goals" ON "cheers"."goal_id" = "goals"."id" WHERE "goals"."user_id" = $1  [["user_id", 1]]