Rails/3_Rails_Testing/GoalSettingApp/app/views/users/show.html.erb

<ul>
    <% @user.goals.each do |g| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 2]]