SQL/02_Active_Record/url_shortener/URLShortener/app/models/shortened_url.rb

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "TPvlWBBKCKsoAW2kVK3tUw"], ["LIMIT", 1]]
---
    def self.random_code
        # repeat until rand_code does not exist in short_url
        # return rand_code if unique
        loop do
            rand_code = SecureRandom.urlsafe_base64
            return rand_code unless ShortenedUrl.exists?(short_url: rand_code)