SQL/02_Active_Record/url_shortener/URLShortener/app/models/visit.rb

    def self.record_visit!(user, shortened_url)
        Visit.create!(
            user_id: user.id,
            shortened_url_id: shortened_url.id
        )
---
INSERT INTO "visits" ("shortened_url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["shortened_url_id", 7], ["user_id", 1], ["created_at", "2020-10-13 01:32:09.134950"], ["updated_at", "2020-10-13 01:32:09.134950"]]