Rails/0_Routes_and_Controllers/art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_collections" ON "artworks"."id" = "artwork_collections"."artwork_id" WHERE "artwork_collections"."collection_id" = $1  [["collection_id", 2]]
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def index
        # Method 1: User methods (3 queries)
        # user = User.find(params[:user_id])
        # art2 = (user.artworks + user.shared_artworks).uniq
        case
        # GET /users/:user_id/artworks
        when params[:user_id]
            # Method 2: Artwork method (1 query)
            art = Artwork.artworks_for_user_id(params[:user_id])
            render json: art

        # GET /collections/:collection_id/artworks
        when params[:collection_id]
            art = Collection.find(params[:collection_id]).artworks

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["likeable_type", "Artwork"], ["likeable_id", 2], ["created_at", "2020-10-27 12:04:37.556976"], ["updated_at", "2020-10-27 12:04:37.556976"]]
---
    def like
        like = Like.new(likes_params)
        if like.save

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 6]]
---
    def unlike
        like = Like.find_by(likes_params)
        like.destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 2], ["artist_id", 5], ["LIMIT", 1]]
---
    def favourite
        # Only user can favourite their own artwork
        artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 2], ["artist_id", 5], ["LIMIT", 1]]
---
    def unfavourite
        artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])