Rails/0_Routes_and_Controllers/art_share_api/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 5], ["created_at", "2020-10-26 14:06:14.736741"], ["updated_at", "2020-10-26 14:06:14.736741"]]
---
    def create
        share = ArtworkShare.new(artwork_share_params)
        if share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["id", 6], ["viewer_id", 5], ["LIMIT", 1]]
---
    def favourite
        artwork_share = ArtworkShare.find_by(id: params[:id], viewer_id: params[:user_id])

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["id", 6], ["viewer_id", 5], ["LIMIT", 1]]
---
    def unfavourite
        artwork_share = ArtworkShare.find_by(id: params[:id], viewer_id: params[:user_id])