Rails/0_Routes_and_Controllers/art_share_api/app/controllers/collections_controller.rb

    def index
        # GET /users/:id/collections
        collection = Collection.where(user_id: params[:user_id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 4]]

    def show
        # GET /collections/:id
        collection = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        # POST /collections
        collection = Collection.new(collection_params)
        if collection.save
---
INSERT INTO "collections" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["name", "test"], ["created_at", "2020-10-28 15:01:42.455922"], ["updated_at", "2020-10-28 15:01:42.455922"]]

    def destroy
        # DELETE /collections/:id
        collection = Collection.find(params[:id])
        collection.destroy
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 2]]

    def add_artwork
        # POST /collections/:collection_id/artworks/:artwork_id/add
        artwork_collection = ArtworkCollection.new(artwork_collection_params)
        if artwork_collection.save
---
INSERT INTO "artwork_collections" ("collection_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 2], ["artwork_id", 2], ["created_at", "2020-10-28 15:03:59.973775"], ["updated_at", "2020-10-28 15:03:59.973775"]]

    def remove_artwork
        # DELETE /collections/:collection_id/artworks/:artwork_id/remove
        artwork_collection = ArtworkCollection.find_by(artwork_collection_params)
        artwork_collection.destroy
---
SELECT  "artwork_collections".* FROM "artwork_collections" WHERE "artwork_collections"."collection_id" = $1 AND "artwork_collections"."artwork_id" = $2 LIMIT $3  [["collection_id", 2], ["artwork_id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_collections" WHERE "artwork_collections"."id" = $1  [["id", 5]]