Rails/0_Routes_and_Controllers/art_share_api/app/controllers/comments_controller.rb

    def index
        case
        #  GET    /users/:user_id/comments
        when params[:user_id]
            user = User.find(params[:user_id])
            comments = user.comments
        # GET    /artworks/:artwork_id/comments
        when params[:artwork_id]
            artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        comment = Comment.new(comments_params)
        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 8], ["artwork_id", 5], ["body", "12345"], ["created_at", "2020-10-26 14:59:57.935376"], ["updated_at", "2020-10-26 14:59:57.935376"]]

    def like
        like = Like.new(likes_params)
        if like.save
---
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2020-10-27 12:02:07.870746"], ["updated_at", "2020-10-27 12:02:07.870746"]]

    def unlike
        like = Like.find_by(likes_params)
        like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 4]]