Rails/0_Routes_and_Controllers/art_share_api/app/controllers/users_controller.rb

    def index
        # GET /users?query=Potter
        if params[:query]
            users = User.where('username LIKE ?',"%#{params[:query]}%")
        else
        # GET /users
            users = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%ron%')