Rails/1_Rails_Views/ninety-nine-cats-pt1/ninetynine_cats/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
            <option disabled selected>--Select Cat--</option>
        <% Cat.all.each do |cat| %>