Rails/5_Rails_Forms/RedditClone/app/models/post.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
    def comments_in_hash
        all_comments = Hash.new { |h, k| h[k] = [] }
        self.comments.includes(:author).each do |comment|