Rails/5_Rails_Forms/RedditClone/app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "7WfJG1Mv0t_AvVfPZKkEmQ"], ["LIMIT", 1]]
---
    def self.generate_session_token
        begin
            token = SecureRandom::urlsafe_base64(16)
        end while User.exists?(session_token: token)

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "123"], ["LIMIT", 1]]
---
    def self.find_by_credentials(name, password)
        user = User.find_by(name: name)